{
  "analysis": [
    {
      "metric": "unique_users",
      "unit": "количество",
      "version_a": 466010.0,
      "version_b": 669032.0,
      "relative_change": 43.56601789661166,
      "insight": "Количество уникальных пользователей выросло на 43.6%, что указывает на успешное привлечение аудитории. Однако рост может быть связан с маркетинговыми активностями или изменениями в канале трафика, а не с улучшением продукта.",
      "solution": "Проведите сегментацию трафика по источникам (например, реклама, органический поиск) и свяжите рост с конкретными кампаниями. Убедитесь, что новые пользователи приходят с релевантных каналов и соответствуют целевой аудитории."
    },
    {
      "metric": "new_users",
      "unit": "количество",
      "version_a": 460069.0,
      "version_b": 669254.0,
      "relative_change": 45.468179773034045,
      "insight": "Рост новых пользователей на 45.5% подтверждает увеличение притока аудитории. Однако высокий прирост новых пользователей при снижении вовлеченности может указывать на слабую удерживаемость.",
      "solution": "Добавьте onboarding-поток для новых пользователей: краткое руководство по основным функциям, подсказки при первом входе и призыв к действию (например, завершить профиль или начать первый сеанс)."
    },
    {
      "metric": "new_user_rate",
      "unit": "проценты",
      "version_a": 37.01505482233829,
      "version_b": 46.73975974126197,
      "relative_change": 26.272296409121875,
      "insight": "Доля новых пользователей выросла с 37% до 46.7%, что говорит о масштабировании аудитории. Однако это может означать, что продукт хуже удерживает новых пользователей, особенно на фоне роста отказов.",
      "solution": "Оптимизируйте первый экран после входа: упростите навигацию, выделите ключевые действия визуально и добавьте CTA-кнопки, ведущие к основным функциям продукта."
    },
    {
      "metric": "bounce_rate",
      "unit": "проценты",
      "version_a": 7.550984613701239,
      "version_b": 9.687032299652273,
      "relative_change": 28.288333180750787,
      "insight": "Уровень отказов вырос на 28.3%, что указывает на то, что больше пользователей покидают сайт после просмотра одной страницы. Это может быть связано с медленной загрузкой, неясным призывом к действию или несоответствием ожиданиям.",
      "solution": "Проверьте скорость загрузки главной страницы и убедитесь, что основной CTA виден без прокрутки. Добавьте визуальные подсказки (иконки, анимации) рядом с кнопками действия."
    },
    {
      "metric": "visits_depth_1",
      "unit": "количество",
      "version_a": 93853.0,
      "version_b": 138706.0,
      "relative_change": 47.79069395757195,
      "insight": "Количество визитов с глубиной в одну страницу выросло на 47.8%, что подтверждает проблему с отказами. Пользователи не переходят дальше первой страницы, несмотря на рост трафика.",
      "solution": "Проведите A/B-тестирование лендинга: сравните текущую версию с вариантом, где контент структурирован по принципу «проблема → решение → CTA» и содержит меньше отвлекающих элементов."
    },
    {
      "metric": "hits_per_user",
      "unit": "количество",
      "version_a": 12.626274114289393,
      "version_b": 9.700124956653791,
      "relative_change": -23.17508024258734,
      "insight": "Среднее количество действий на пользователя снизилось на 23.2%, что говорит о снижении активности. Пользователи взаимодействуют с продуктом реже, несмотря на рост числа новых пользователей.",
      "solution": "Внедрите систему рекомендаций: после выполнения действия показывайте подсказки «Что дальше?» или «Попробуйте также». Увеличьте видимость второстепенных, но полезных функций через тултипы."
    },
    {
      "metric": "top_pages_count",
      "unit": "количество",
      "version_a": 1090504.0,
      "version_b": 1946722.0,
      "relative_change": 78.51580553578896,
      "insight": "Количество просмотров топовых страниц выросло на 78.5%, что может указывать на концентрацию трафика на узком наборе страниц. Остальные разделы продукта могут быть недостаточно доступны.",
      "solution": "Проанализируйте, какие страницы стали лидерами. Если это лендинги или главная страница — улучшите навигацию с них, добавив карточки популярных функций с прямым переходом к ним."
    }
  ]
}